xrun: 22.09-s001: (c) Copyright 1995-2022 Cadence Design Systems, Inc.
TOOL:	xrun	22.09-s001: Started on Apr 21, 2023 at 23:58:12 PDT
xrun
	-timescale 1ns/10ps
	counter_netlist.v
	counter_test.v
	-v slow_vdd1v0_basicCells.v
	-access +rwc
	-define SDF_TEST
	-mess
	-gui
file: counter_netlist.v
	module worklib.counter:v
		errors: 0, warnings: 0
file: counter_test.v
	module worklib.counter_test:v
		errors: 0, warnings: 0
file: slow_vdd1v0_basicCells.v
	module slow_vdd1v0_basicCells.INVX1:v
		errors: 0, warnings: 0
	module slow_vdd1v0_basicCells.NAND2BX1:v
		errors: 0, warnings: 0
	module slow_vdd1v0_basicCells.NAND2X1:v
		errors: 0, warnings: 0
	module slow_vdd1v0_basicCells.SDFFRHQX1:v
		errors: 0, warnings: 0
	module slow_vdd1v0_basicCells.XNOR2X1:v
		errors: 0, warnings: 0
	module slow_vdd1v0_basicCells.XOR2XL:v
		errors: 0, warnings: 0
	primitive slow_vdd1v0_basicCells.altos_dff_r_err:v
		errors: 0, warnings: 0
	primitive slow_vdd1v0_basicCells.altos_dff_r:v
		errors: 0, warnings: 0
		Caching library 'slow_vdd1v0_basicCells' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		counter_test
	Reading SDF file from location "delays.sdf"
	Writing compiled SDF file to "delays.sdf.X".
	Annotating SDF timing data:
		Compiled SDF file:     delays.sdf.X
		Log file:              sdf.log
		Backannotation scope:  counter_test.counter1
		Configuration file:    
		MTM control:           MAXIMUM
		Scale factors:         
		Scale type:            
	Annotation completed successfully...
	SDF statistics: 
		 No. of Pathdelays = 57      	 No. of Disabled Pathdelays = 0        Annotated = 100.00% (57/57) 
		 No. of Tchecks    = 96      	 No. of Disabled Tchecks    = 0        Annotated = 66.67% (64/96) 
				        Total(T) 	   Disabled(D) 	    Annotated(A)	  Percentage(A/(T-D))
		 Path Delays	            57	             0	                57	                100.00
		       $hold	             8	             0	                 0	                  0.00
		    $removal	             8	             0	                 8	                100.00
		      $width	            24	             0	                 0	                  0.00
		   $recovery	             8	             0	                 8	                100.00
		  $setuphold	            48	             0	                48	                100.00
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.counter:v <0x48b480b6>
			streams:   0, words:     0
		worklib.counter_test:v <0x382d5009>
			streams:   6, words:  1426
		slow_vdd1v0_basicCells.SDFFRHQX1:v <0x3f3c5ee4>
			streams:   0, words:     0
		slow_vdd1v0_basicCells.SDFFRHQX1:v <0x54185213>
			streams:   0, words:     0
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                    Instances  Unique
		Modules:                   24       8
		UDPs:                      16       2
		Primitives:                79       5
		Timing outputs:            22       5
		Registers:                 12       7
		Scalar wires:              43       -
		Always blocks:              1       1
		Initial blocks:             2       2
		Cont. assignments:          0       1
		Pseudo assignments:         4       4
		Timing checks:            144      19
		Interconnect:              67       -
		Delayed tcheck signals:    40      18
		Simulation timescale:    10ps
	Writing initial simulation snapshot: worklib.counter_test:v
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /grid/avs/install/xcelium/2209/22.09.001/tools/xcelium/files/xmsimrc
xcelium> force SE 0
xcelium> force scan_in 0
xcelium> force scan_out 0
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm counter_test.SE counter_test.clk counter_test.count counter_test.rst counter_test.scan_in counter_test.scan_out
Created probe 1
xcelium> run
Simulation stopped via $stop(1) at time 1010 NS + 0
xcelium> probe -create -shm counter_test.counter1.g705.Y counter_test.counter1.g705.A
Created probe 2
xcelium> reset
Loaded snapshot worklib.counter_test:v
xcelium> force SE 0
xcelium> force scan_in 0
xcelium> force scan_out 0
xcelium> run
Simulation stopped via $stop(1) at time 1010 NS + 0
xcelium> ^C
xcelium> exit
TOOL:	xrun	22.09-s001: Exiting on Apr 22, 2023 at 01:15:49 PDT  (total: 01:17:37)
